import 'package:google_maps_flutter/google_maps_flutter.dart';

enum RouteModel {
  route1(
    title: "BUP-Uttara",
    busId: ["busID1", "busID2"],
    image: "BUS_ROUTE_STD-0.png",
    start: "BUP",
    startLat: 23.83944781693273,
    startLong: 90.35820879403578,
    stopsInOrder: [
      "DOHS",
      "ডিওএইচএস",
      "অবকাশ",
      "MCPSC",
      "সরবর",
      "পলাশ বিল্ডিং",
      "Polash Buildin",
      "DOHS Mall",
      "ECB Canteen",
      "ইসিবি ক্যান্টিন",
      "ECB Chattar",
      "Kalshi",
      "কালসি",
      "কালশি",
      "কালসী",
      "কালশী",
      "কালসি মোড়",
      "kalshi mor",
      "ECB",
      "ইসিবি",
      "ইসিবি চত্বর",
      "ইসিবি মোড়",
      "ইসিবি চত্বর",
      "ECB Chattar",
      "মানিকদি",
      "মানিকদী",
      "মানিকদি মোড়",
      "MES",
      "Bimanbandar",
      "বিমানবন্দর",
      "Le Meridan",
      "Shewra",
      "শেওড়া",
      "Khilkhet",
      "খিলক্ষেত",
      "খিলক্ষেত মোড়",
      "খিলখেত",
      "Kawla",
      "কাউলা",
      "Airport",
      "এয়ারপোর্ট",
      "Jashimuddin",
      "জশিমউদ্দিন",
      "জসিমউদ্দিন",
      "Rajlakkhi",
      "রাজলক্ষী",
      "রাজলক্ষি",
      "Ajampur",
      "Azampur",
      "আজমপুর",
      "Uttara",
      "Uttara Centerpoint",
      "Uttara Sector 4",
      "Uttara Sector 7",
      "Uttara Sector 10",
      "Uttara Sector 12",
      "Uttara Sector 14",
      "Uttara Sector 16",
      "House Building",
      "উত্তরা",
      "হাউজ বিল্ডিং",
      "Mascot Plaza",
      "মাস্কট প্লাজা",
    ],
    routeCoordinatesInOrder: [
      LatLng(23.83944781693273, 90.35820879403578), // BUP In Gate
      LatLng(23.834961899131887, 90.35881453781377), // DSCSC
      LatLng(23.831960189009205, 90.36158785487743), // DSCSC Mosque
      LatLng(23.831993428090584, 90.3636712000425), // NDC
      LatLng(23.833415394533798, 90.3636705510294), //OBOKASH
      LatLng(23.837073469037144, 90.36348384906073), //Polash Building
      LatLng(23.837253820339757, 90.36363221509522), // Carwash
      LatLng(23.837347046427823, 90.36630742234367), // DOHS AV2
      LatLng(23.837745136964287, 90.37424961459355), // DOHS AV8
      LatLng(23.83739951887143, 90.37584436492884), // DOHS Mall
      LatLng(23.83676251822987, 90.37646765936063), //Shagufta
      LatLng(23.83215846603242, 90.37673091487551), //Shopnonagar
      LatLng(23.823186151034655, 90.377942996345), // Kalshi Mor
      LatLng(23.82311043108477, 90.37807116664166),
      LatLng(23.823203651639872, 90.37871489905604), // Kalshi Mor2
      LatLng(23.823279734052914, 90.37901530420213),
      LatLng(23.82341714001223, 90.37944445768153),
      LatLng(23.823561904785667, 90.37984679034098), //mtd project
      LatLng(23.823564359783003, 90.380219616497885),
      LatLng(23.8234932022025, 90.380469061833),
      LatLng(23.82337542693857, 90.38075069370743),
      LatLng(23.822879784722247, 90.38156071988789),
      LatLng(23.822317890170762, 90.38236269865767),
      LatLng(23.82150326284769, 90.38344094575001), //safa automobil
      LatLng(23.820757323615396, 90.38459960402962),
      LatLng(23.820757318516836, 90.38485709635567),
      LatLng(23.820295950895957, 90.38674537202658), //volta
      LatLng(23.82005058162218, 90.38886970082721),
      LatLng(23.82030573710519, 90.39001768849784),
      LatLng(23.821414735192157, 90.39132663889457),
      LatLng(23.821640479173556, 90.39164849215575),
      LatLng(23.822327494921453, 90.39260336391328),
      LatLng(23.82262516657742, 90.3931673681746), //asw
      LatLng(23.822691396994813, 90.39346340743236),
      LatLng(23.82261213042945, 90.3936076607915),
      LatLng(23.82240205481611, 90.39365230428281), //ecb
      LatLng(23.818047082935795, 90.39759986301053), // Flyover open
      LatLng(23.81732051200741, 90.39814072817173),
      LatLng(23.817119165433958, 90.39838633491385),
      LatLng(23.816935326376946, 90.39871168498179),
      LatLng(23.816529396303036, 90.40013418623737),
      LatLng(23.816502405232306, 90.40138946205958),
      LatLng(23.816342905406287, 90.40362642192873),
      LatLng(23.816396890292612, 90.40468321275448),
      LatLng(23.816603010679508, 90.40527866527214),
      LatLng(23.816968625685735, 90.40600822639902),
      LatLng(23.817145299034006, 90.40653125695557),
      LatLng(23.817191920802884, 90.40727959312811),
      LatLng(23.817135483359163, 90.40797964975789),
      LatLng(23.817022607549344, 90.40835515859686),
      LatLng(23.817017701994654, 90.40836052350132),
      LatLng(23.8169686261691, 90.40916786850538),
      LatLng(23.816858205491677, 90.4105304308003),
      LatLng(23.816914640975682, 90.41140214813943),
      LatLng(23.81713635846058, 90.41199696532134),
      LatLng(23.81788234436986, 90.41323775965726),
      LatLng(23.81909450164337, 90.4151260366119), //Army Golf Club
      LatLng(23.820867537195483, 90.41803602543325),
      LatLng(23.821350511686155, 90.41852489935962),
      LatLng(23.821875739581422, 90.4191883736694),
      LatLng(23.82274529763046, 90.41975612417704),
      LatLng(23.82370712379933, 90.42026353775591),
      LatLng(23.823742274750757, 90.42025425168839),
      LatLng(23.824625757291507, 90.42036823817415),
      LatLng(23.825626884936266, 90.42040734065881),
      LatLng(23.825620251790237, 90.42040081588544),
      LatLng(23.831360076759832, 90.41946972433593),
      LatLng(23.836400319535738, 90.41858908258934), //Le meridian
      LatLng(23.83805878210779, 90.41810632879687),
      LatLng(23.839982235244708, 90.4169154180377),
      LatLng(23.845340209770583, 90.41275262266726),
      LatLng(23.853934666504994, 90.405530449799), //Uttara Centerpoint
      LatLng(23.860040456850804, 90.4004435490099),
      LatLng(23.86086316002976, 90.40003315210659),
      LatLng(23.8620011245381, 90.39978363047052),
      LatLng(23.862994956387002, 90.39975408177992),
      LatLng(23.863760594526262, 90.39992481029881),
      LatLng(23.867749545015535, 90.40011912270288),
      LatLng(23.87049657562085, 90.40034587339576),
      LatLng(23.87093110017947, 90.40031914720339), //bns
      LatLng(23.87460014380525, 90.40026793911221),
      LatLng(23.87459987591613, 90.40048996788482), //hosue building
    ],
    end: "House Building",
    endLat: 23.87459987591613,
    endLong: 90.40048996788482,
  ),
  route2(
    title: "BUP-JFP-Kakrail",
    busId: ["busID3", "busID4"],
    image: "BUS_ROUTE_STD-1.png",
    start: "BUP",
    startLat: 23.83944781693273,
    startLong: 90.35820879403578,
    stopsInOrder: [
      "DOHS",
      "ডিওএইচএস",
      "অবকাশ",
      "MCPSC",
      "সরবর",
      "পলাশ বিল্ডিং",
      "Polash Buildin",
      "DOHS Mall",
      "ECB Canteen",
      "ইসিবি ক্যান্টিন",
      "ECB Chattar",
      "Kalshi",
      "কালসি",
      "কালশি",
      "কালসী",
      "কালশী",
      "কালসি মোড়",
      "kalshi mor",
      "ECB",
      "ইসিবি",
      "ইসিবি চত্বর",
      "ইসিবি মোড়",
      "ইসিবি চত্বর",
      "ECB Chattar",
      "মানিকদি",
      "মানিকদী",
      "মানিকদি মোড়",
      "MES",
      "ইসিবি চত্বর",
      "Shewra",
      "শেওড়া",
      "কুড়িল",
      "বসুন্ধরা আবাসিক",
      "বসুন্ধরা আবাসিক এলাকা",
      "Bisso Road",
      "বিশ্ব রোড",
      "JFP",
      "যমুনা ফিউচার পার্ক",
      "Jamuna Future Park",
      "Shahjadpur",
      "শাহজাদপুর",
      "Uttar Badda",
      "উত্তর বাড্ডা",
      "মেরুল",
      "নর্দা",
      "Norda",
      "নদ্দা",
      "গুলশান লিংক রোড",
      "মধ্য বাড্ডা",
      "রামপুরা ব্রিজ",
      "রামপুরা বাজার",
      "আবুল হোটেল",
      "মালিবাগ রেলগেট",
      "মৌচাক",
      "Gulshan Link Road",
      "Middle Badda",
      "Rampura Bridge",
      "Rampura Bazar",
      "Abul Hotel",
      "Malibag Railgate",
      "Mouchak",
      "Mouchak Market",
      "Gulshan Link Road",
      "গুলশান লিংক রোড",
      "Kakrail",
      "কাকড়াইল",
    ],
    routeCoordinatesInOrder: [
      LatLng(23.83944781693273, 90.35820879403578), // BUP In Gate
      LatLng(23.834961899131887, 90.35881453781377), // DSCSC
      LatLng(23.831960189009205, 90.36158785487743), // DSCSC Mosque
      LatLng(23.831993428090584, 90.3636712000425), // NDC
      LatLng(23.833415394533798, 90.3636705510294), //OBOKASH
      LatLng(23.837073469037144, 90.36348384906073), //Polash Building
      LatLng(23.837253820339757, 90.36363221509522), // Carwash
      LatLng(23.837347046427823, 90.36630742234367), // DOHS AV2
      LatLng(23.837745136964287, 90.37424961459355), // DOHS AV8
      LatLng(23.83739951887143, 90.37584436492884), // DOHS Mall
      LatLng(23.83676251822987, 90.37646765936063), //Shagufta
      LatLng(23.83215846603242, 90.37673091487551), //Shopnonagar
      LatLng(23.823186151034655, 90.377942996345), // Kalshi Mor
      LatLng(23.82311043108477, 90.37807116664166),
      LatLng(23.823203651639872, 90.37871489905604), // Kalshi Mor2
      LatLng(23.823279734052914, 90.37901530420213),
      LatLng(23.82341714001223, 90.37944445768153),
      LatLng(23.823561904785667, 90.37984679034098), //mtd project
      LatLng(23.823564359783003, 90.380219616497885),
      LatLng(23.8234932022025, 90.380469061833),
      LatLng(23.82337542693857, 90.38075069370743),
      LatLng(23.822879784722247, 90.38156071988789),
      LatLng(23.822317890170762, 90.38236269865767),
      LatLng(23.82150326284769, 90.38344094575001), //safa automobil
      LatLng(23.820757323615396, 90.38459960402962),
      LatLng(23.820757318516836, 90.38485709635567),
      LatLng(23.820295950895957, 90.38674537202658), //volta
      LatLng(23.82005058162218, 90.38886970082721),
      LatLng(23.82030573710519, 90.39001768849784),
      LatLng(23.821414735192157, 90.39132663889457),
      LatLng(23.821640479173556, 90.39164849215575),
      LatLng(23.822327494921453, 90.39260336391328),
      LatLng(23.82262516657742, 90.3931673681746), //asw
      LatLng(23.822691396994813, 90.39346340743236),
      LatLng(23.82261213042945, 90.3936076607915),
      LatLng(23.82240205481611, 90.39365230428281), //ecb
      LatLng(23.818047082935795, 90.39759986301053), // Flyover open
      LatLng(23.81732051200741, 90.39814072817173),
      LatLng(23.817119165433958, 90.39838633491385),
      LatLng(23.816935326376946, 90.39871168498179),
      LatLng(23.816529396303036, 90.40013418623737),
      LatLng(23.816502405232306, 90.40138946205958),
      LatLng(23.816342905406287, 90.40362642192873), //divide of flyover
      LatLng(23.816396890292612, 90.40468321275448),
      LatLng(23.816603010679508, 90.40527866527214),
      LatLng(23.816968625685735, 90.40600822639902),
      LatLng(23.817145299034006, 90.40653125695557),
      LatLng(23.817191920802884, 90.40727959312811),
      LatLng(23.817135483359163, 90.40797964975789),
      LatLng(23.817022607549344, 90.40835515859686),
      LatLng(23.817017701994654, 90.40836052350132),
      LatLng(23.8169686261691, 90.40916786850538),
      LatLng(23.816858205491677, 90.4105304308003),
      LatLng(23.816914640975682, 90.41140214813943),
      LatLng(23.81713635846058, 90.41199696532134),
      LatLng(23.81788234436986, 90.41323775965726),
      LatLng(23.81909450164337, 90.4151260366119), //Army Golf Club
      LatLng(23.820529208623853, 90.41740934231993), // kuril flyover start
      LatLng(23.821716777470687, 90.41883623699826),
      LatLng(23.822335110905115, 90.41952289491496),
      LatLng(23.82240381259538, 90.41980184934025),
      LatLng(23.822295843467906, 90.42026319406105),
      LatLng(23.822148612223987, 90.4207996405514),
      LatLng(23.821824716538103, 90.42103567062209),
      LatLng(23.821549900219875, 90.42099274831433),
      LatLng(23.82126527136323, 90.42082107906981),
      LatLng(23.820609897011483, 90.42054295403175),
      LatLng(23.820428982865025, 90.42033562289558),
      LatLng(23.820310784780958, 90.42027427466881),
      LatLng(23.82007769295866, 90.42027698105362), //progoti sarani starts
      LatLng(23.818693780048783, 90.42090193686286),
      LatLng(23.817751532782236, 90.4210843268003),
      LatLng(23.808661721319474, 90.42149526405326),
      LatLng(23.804498643806983, 90.42210813900027),
      LatLng(23.783764885434152, 90.42606634418343),
      LatLng(23.778419943013155, 90.42569160437091),
      LatLng(23.775047968733222, 90.42606810713838), //Uloop badda
      LatLng(23.772082797943845, 90.42548874670732),
      LatLng(23.77022708979799, 90.42466260936001),
      LatLng(23.766188026880847, 90.42228280002202), //Rampura bridge
      LatLng(23.756307762347888, 90.41673347929088),
      LatLng(23.749232436073957, 90.41242508062791),
      LatLng(23.745655832435858, 90.41236269566583), //Outer circular road
      LatLng(23.744104166647656, 90.41411151693832),
      LatLng(23.737799191101697, 90.40922987986882),
      LatLng(23.737514747415975, 90.40873031467241),
    ],
    end: "Kakrail",
    endLat: 23.737514747415975,
    endLong: 90.40873031467241,
  ),
  route3(
    title: "BUP-Maghbazar-Kakrail",
    busId: ["busID5", "busID6"],
    image: "BUS_ROUTE_STD-2.png",
    start: "BUP",
    startLat: 23.83944781693273,
    startLong: 90.35820879403578,
    stopsInOrder: [
      "DOHS",
      "ডিওএইচএস",
      "অবকাশ",
      "MCPSC",
      "সরবর",
      "পলাশ বিল্ডিং",
      "Polash Buildin",
      "DOHS Mall",
      "ECB Canteen",
      "ইসিবি ক্যান্টিন",
      "ECB Chattar",
      "Kalshi",
      "কালসি",
      "কালশি",
      "কালসী",
      "কালশী",
      "কালসি মোড়",
      "kalshi mor",
      "ECB",
      "ইসিবি",
      "ইসিবি চত্বর",
      "ইসিবি মোড়",
      "ইসিবি চত্বর",
      "ECB Chattar",
      "মানিকদি",
      "মানিকদী",
      "মানিকদি মোড়",
      "MES",
      "Navy HQ",
      "নেভী হেড কোয়ার্টার্স",
      "Army Stadium",
      "আর্মি স্টেডিয়াম",
      "banani",
      "বনানী",
      "Kakali",
      "কাকালী",
      "কাকলি",
      "কাকলী",
      "kakoli",
      "Chairman Bari",
      "চেয়ারম্যান বাড়ি",
      "sainik Club",
      "সৈনিক ক্লাব",
      "Mahakhali",
      "মহাখালী",
      "মহাখালি",
      "Mohakhali",
      "Nabisco",
      "নাবিস্ক",
      "নাবিস্কো",
      "Sat Rasta",
      "সাত রাস্তা",
      "Hatirjheel",
      "হাতিরঝিল্‌",
      "Maghbazar",
      "মগবাজার",
    ],
    routeCoordinatesInOrder: [
      LatLng(23.83944781693273, 90.35820879403578), // BUP In Gate
      LatLng(23.834961899131887, 90.35881453781377), // DSCSC
      LatLng(23.831960189009205, 90.36158785487743), // DSCSC Mosque
      LatLng(23.831993428090584, 90.3636712000425), // NDC
      LatLng(23.833415394533798, 90.3636705510294), //OBOKASH
      LatLng(23.837073469037144, 90.36348384906073), //Polash Building
      LatLng(23.837253820339757, 90.36363221509522), // Carwash
      LatLng(23.837347046427823, 90.36630742234367), // DOHS AV2
      LatLng(23.837745136964287, 90.37424961459355), // DOHS AV8
      LatLng(23.83739951887143, 90.37584436492884), // DOHS Mall
      LatLng(23.83676251822987, 90.37646765936063), //Shagufta
      LatLng(23.83215846603242, 90.37673091487551), //Shopnonagar
      LatLng(23.823186151034655, 90.377942996345), // Kalshi Mor
      LatLng(23.82311043108477, 90.37807116664166),
      LatLng(23.823203651639872, 90.37871489905604), // Kalshi Mor2
      LatLng(23.823279734052914, 90.37901530420213),
      LatLng(23.82341714001223, 90.37944445768153),
      LatLng(23.823561904785667, 90.37984679034098), //mtd project
      LatLng(23.823564359783003, 90.380219616497885),
      LatLng(23.8234932022025, 90.380469061833),
      LatLng(23.82337542693857, 90.38075069370743),
      LatLng(23.822879784722247, 90.38156071988789),
      LatLng(23.822317890170762, 90.38236269865767),
      LatLng(23.82150326284769, 90.38344094575001), //safa automobil
      LatLng(23.820757323615396, 90.38459960402962),
      LatLng(23.820757318516836, 90.38485709635567),
      LatLng(23.820295950895957, 90.38674537202658), //volta
      LatLng(23.82005058162218, 90.38886970082721),
      LatLng(23.82030573710519, 90.39001768849784),
      LatLng(23.821414735192157, 90.39132663889457),
      LatLng(23.821640479173556, 90.39164849215575),
      LatLng(23.822327494921453, 90.39260336391328),
      LatLng(23.82262516657742, 90.3931673681746), //asw
      LatLng(23.822691396994813, 90.39346340743236),
      LatLng(23.82261213042945, 90.3936076607915),
      LatLng(23.82240205481611, 90.39365230428281), //ecb
      LatLng(23.818047082935795, 90.39759986301053), // Flyover open
      LatLng(23.81732051200741, 90.39814072817173),
      LatLng(23.817119165433958, 90.39838633491385),
      LatLng(23.816935326376946, 90.39871168498179),
      LatLng(23.816529396303036, 90.40013418623737),
      LatLng(23.816502405232306, 90.40138946205958),
      LatLng(23.816342905406287, 90.40362642192873), //divide of flyover
      LatLng(23.816325937325463, 90.40400636266241), //
      LatLng(23.81606092638859, 90.4049263613361), //
      LatLng(23.815695308079498, 90.405744433617), //
      LatLng(23.815739476727074, 90.40612530804401), //
      LatLng(23.815911263977142, 90.4062406360965), //
      LatLng(23.816259738741117, 90.40626205950863), //
      LatLng(23.81640696855475, 90.40592946488931), //
      LatLng(23.81631863157386, 90.40562369178382), //
      LatLng(23.816167759850508, 90.40541139771504), //
      LatLng(23.81616776004864, 90.40539773273994), //
      LatLng(23.816167760028, 90.40540749367553), //
      LatLng(23.816165974099683, 90.40539773273487), //
      LatLng(23.816030242293525, 90.4051380918023), //Flyover out
      LatLng(23.815824077620505, 90.40496375634174),
      LatLng(23.815129667075425, 90.40458292589736), //
      LatLng(23.81427085548209, 90.40431736224328),
      LatLng(23.81272149944605, 90.40406968736808),
      LatLng(23.777863090049227, 90.39812406513963), //Mohakhali
      LatLng(23.777141052487632, 90.39848826783671),
      LatLng(23.775335988114144, 90.39885239303561),
      LatLng(23.77424614739625, 90.39942104913476),
      LatLng(23.773401660938763, 90.40008617007847),
      LatLng(23.773431116437962, 90.40007544194451),
      LatLng(23.772723240457704, 90.40085137281909), //
      LatLng(23.770898581121994, 90.40122128149982),
      LatLng(23.756832366040683, 90.398979389607), //FDC
      LatLng(23.753289366804967, 90.40095559726527), //
      LatLng(23.748929291143565, 90.40366217930844),
      LatLng(23.74751512198706, 90.40411278120676),
      LatLng(23.74513849531622, 90.40425226743551),
      LatLng(23.74388143234239, 90.40549678126109), //DMPHQ
      LatLng(23.74253591415435, 90.40578650633384),
      LatLng(23.739874460853848, 90.4056470162799), //
      LatLng(23.737625451396237, 90.40530363979614),
      LatLng(23.73760367637909, 90.4086918588453), //Kakrail
    ],
    end: "Kakrail",
    endLat: 23.73760367637909,
    endLong: 90.4086918588453,
  ),
  route4(
    title: "BUP-Shahbagh",
    busId: ["busID7", "busID8"],
    image: "BUS_ROUTE_STD-3.png",
    start: "BUP",
    startLat: 23.83944781693273,
    startLong: 90.35820879403578,
    stopsInOrder: [
      "DOHS",
      "ডিওএইচএস",
      "অবকাশ",
      "MCPSC",
      "সরবর",
      "পলাশ বিল্ডিং",
      "Polash Buildin",
      "DOHS Mall",
      "ECB Canteen",
      "ইসিবি ক্যান্টিন",
      "ECB Chattar",
      "Kalshi",
      "কালসি",
      "কালশি",
      "কালসী",
      "কালশী",
      "কালসি মোড়",
      "kalshi mor",
      "ECB",
      "ইসিবি",
      "ইসিবি চত্বর",
      "ইসিবি মোড়",
      "ইসিবি চত্বর",
      "ECB Chattar",
      "মানিকদি",
      "মানিকদী",
      "মানিকদি মোড়",
      "MES",
      "nirrjhor",
      "নির্ঝর",
      "nirjhar",
      "নির্ঝর",
      "nirjhor",
      "মেস",
      "এমইএস",
      "Matikata",
      "মাটিকাটা",
      "Zia Colony",
      "জিয়া কলোনি",
      "জিয়া কলোনী",
      "জিয়া কলনি",
      "CMH",
      "সিএমএইচ",
      "সিএমএইচ হাসপাতাল",
      "Army HQ",
      "আর্মি হেড কোয়ার্টার্স",
      "আর্মি হেড",
      "ঢাকা ক্যান্টনমেন্ট",
      "ঢাকা ক্যান্টনমেন্ট হেড কোয়ার্টার্স",
      "আদমজী কলেজ",
      "আদমজি",
      "পকেট গেট",
      "হাজী মহসিন",
      "BNS",
      "kafrul",
      "কাফরুল",
      "রজনীগন্ধা",
      "rajanigandha",
      "সি এস ডি",
      "গ্যারিসন",
      "ওয়ার্কশপ",
      "শহীদ জাহাঙ্গীর গেট",
      "বিজয় সরণি",
      "ফার্মগেট",
      "কারওয়ান বাজার",
      "বাংলা মোটর",
      "CSD",
      "Post Office",
      "পোস্ট অফিস",
      "Adamji",
      "Workshop",
      "Shahid Jahangir Gate",
      "জাহাঙ্গীর গেট",
      "Jahangir Gate",
      "জাহাঙ্গীরগেট",
      "শাহবাগ",
      "শাহীন কলেজ",
      "শাহিন কলেজ",
      "BAF Shaeen College",
      "Bijoy Sarani",
      "Farmgate",
      "Karwan Bazar",
      "Bangla Motor",
    ],
    routeCoordinatesInOrder: [
      LatLng(23.83944781693273, 90.35820879403578), // BUP In Gate
      LatLng(23.834961899131887, 90.35881453781377), // DSCSC
      LatLng(23.831960189009205, 90.36158785487743), // DSCSC Mosque
      LatLng(23.831993428090584, 90.3636712000425), // NDC
      LatLng(23.833415394533798, 90.3636705510294), //OBOKASH
      LatLng(23.837073469037144, 90.36348384906073), //Polash Building
      LatLng(23.837253820339757, 90.36363221509522), // Carwash
      LatLng(23.837347046427823, 90.36630742234367), // DOHS AV2
      LatLng(23.837745136964287, 90.37424961459355), // DOHS AV8
      LatLng(23.83739951887143, 90.37584436492884), // DOHS Mall
      LatLng(23.83676251822987, 90.37646765936063), //Shagufta
      LatLng(23.83215846603242, 90.37673091487551), //Shopnonagar
      LatLng(23.823186151034655, 90.377942996345), // Kalshi Mor
      LatLng(23.82311043108477, 90.37807116664166),
      LatLng(23.823203651639872, 90.37871489905604), // Kalshi Mor2
      LatLng(23.823279734052914, 90.37901530420213),
      LatLng(23.82341714001223, 90.37944445768153),
      LatLng(23.823561904785667, 90.37984679034098), //mtd project
      LatLng(23.823564359783003, 90.380219616497885),
      LatLng(23.8234932022025, 90.380469061833),
      LatLng(23.82337542693857, 90.38075069370743),
      LatLng(23.822879784722247, 90.38156071988789),
      LatLng(23.822317890170762, 90.38236269865767),
      LatLng(23.82150326284769, 90.38344094575001), //safa automobil
      LatLng(23.820757323615396, 90.38459960402962),
      LatLng(23.820757318516836, 90.38485709635567),
      LatLng(23.820295950895957, 90.38674537202658), //volta
      LatLng(23.82005058162218, 90.38886970082721),
      LatLng(23.82030573710519, 90.39001768849784),
      LatLng(23.821414735192157, 90.39132663889457),
      LatLng(23.821640479173556, 90.39164849215575),
      LatLng(23.822327494921453, 90.39260336391328),
      LatLng(23.82262516657742, 90.3931673681746), //asw
      LatLng(23.822691396994813, 90.39346340743236),
      LatLng(23.82261213042945, 90.3936076607915),
      LatLng(23.82240205481611, 90.39365230428281), //ecb
      LatLng(23.821392435048026, 90.39465386440942),
      LatLng(23.819037996242226, 90.39677272653911), //mes flyover er niche
      LatLng(23.817916087030593, 90.39771163077164),
      LatLng(23.81749880563328, 90.39803219625557), //matikata mp checkpost
      LatLng(23.817136386955674, 90.39833622410896), //zia colony r signal head
      LatLng(23.816974410950166, 90.39864860526305),
      LatLng(23.8170160043422, 90.39855930479541),
      LatLng(23.816842495292146, 90.39890828026978),
      LatLng(23.816682863327852, 90.39957209239496),
      LatLng(23.816668982312855, 90.39960623124686),
      LatLng(23.81661692814612, 90.39976933919195),
      LatLng(23.816571813295983, 90.40001969128198), //AIr HQ Stop
      LatLng(23.816536232759834, 90.40088063558868),
      LatLng(23.81650340410433, 90.40119880832806),
      LatLng(23.81647477619833, 90.40204681334005),
      LatLng(23.816360241428942, 90.4020978484622), //U turn
      LatLng(23.816398950103476, 90.401243684606885),
      LatLng(23.816337570719906, 90.40071793497),
      LatLng(23.816331436130604, 90.40037193007704),
      LatLng(23.816320394008184, 90.40025659512408),
      LatLng(23.81555559124947, 90.40025512816125), //CMH gate
      LatLng(23.81461467462672, 90.40027768235286), //AFP
      LatLng(23.81381818835985, 90.40027768540892),
      LatLng(23.8131455111835, 90.4001558886942), //AFIP BUS STOP
      LatLng(23.81158140560969, 90.39961909114199), //VSOQ MESS
      LatLng(23.810351572072737, 90.3992717475962),
      LatLng(23.809670615967857, 90.39921310707891),
      LatLng(23.806714812211403, 90.39889221814245),
      LatLng(23.805732564348258, 90.39852682983236), //DC BUS STOP
      LatLng(23.80439536850653, 90.39773290916798),
      LatLng(23.80368549313562, 90.39702920523685),
      LatLng(23.8024741722743, 90.39581655215709), //CSD CInderella
      LatLng(23.80158570152203, 90.39490618488685),
      LatLng(23.800509816897165, 90.39438272340325),
      LatLng(23.79997534531362, 90.39415513191791),
      LatLng(23.799454740139716, 90.3940185760419),
      LatLng(23.797872105473374, 90.39357855746375), //Shikha anirban
      LatLng(23.79541483380337, 90.39292612098482), //mynul road
      LatLng(23.79252712612295, 90.39230403490515),
      LatLng(23.7905279128453, 90.39187160827302), //4 rasta
      LatLng(23.788632793092475, 90.39118882817917),
      LatLng(23.787168049614365, 90.39089295773681),
      LatLng(23.786480785589244, 90.3906274374047),
      LatLng(23.785085434244245, 90.39015707311444), //ISPRD
      LatLng(23.78308610812019, 90.38956533179567),
      LatLng(23.781794852076256, 90.38943636122195),
      LatLng(23.779274785290017, 90.38939843402872), //Basar base
      LatLng(23.77576484099117, 90.38987603610781), // Jahangir Gate
      LatLng(23.775757779527297, 90.38994748427129), // Jahangir Gate Final
      LatLng(23.773695904761787, 90.39010842427076),
      LatLng(23.769702955151754, 90.38947836980704), //Shishmahal
      LatLng(23.76831091310558, 90.38923897633474),
      LatLng(23.76692847175866, 90.38908758290962),
      LatLng(23.764621660591978, 90.38904921534399), //Bijoy Sarani
      LatLng(23.761221930909453, 90.38940086149694),
      LatLng(23.761214987752123, 90.38938568867711),
      LatLng(23.759006983304708, 90.38985605019217), //khamar bari r matha
      LatLng(23.75026732013162, 90.39324953250065), //Karwanbazar
      LatLng(23.750057844951524, 90.3932505174848),
      LatLng(23.750011198809375, 90.39331891368677),
      LatLng(23.749838117257255, 90.39340206168626),
      LatLng(23.749743597444716, 90.39336451116323),
      LatLng(23.74936797250598, 90.39352812638427),
      LatLng(23.747293941566834, 90.39430057473308),
      LatLng(23.745178803154737, 90.39501967885566), //Bangla Motor
      LatLng(23.742729158127933, 90.3958073775198), //telecom bhaban
      LatLng(23.740798619004682, 90.39614117970355), //intercontinantal
      LatLng(23.738106930210062, 90.39587882926317), //Shahbag End
    ],
    end: "Shahbagh",
    endLat: 23.738106930210062,
    endLong: 90.39587882926317,
  ),
  route5(
    title: "BUP-Khamar Bari Mor",
    busId: ["busID9", "busID10"],
    image: "BUS_ROUTE_STD-4.png",
    start: "BUP",
    startLat: 23.83944781693273,
    startLong: 90.35820879403578,
    stopsInOrder: [
      "Mirpur 12",
      "মিরপুর ১২",
      "মিরপুর ১১.৫",
      "মিরপুর ১১",
      "মিরপুর ১০",
      "কাজীপাড়া",
      "শেওড়াপাড়া",
      "তালতলা",
      "আগারগাঁও",
      "চন্দ্রিমা উদ্দান",
      "farmgate",
      "ফার্মগেট",
      "খামার বাড়ি মোড়",
      "খামার বাড়ি",
      "মানিক মিয়া এভিনিউ",
      "মানিক মিয়া",
      "Mirpur 11.5",
      "Mirpur 11",
      "Mirpur 10",
      "Kazipara",
      "Shewrapara",
      "Taltola",
      "Agargaon",
      "Krishi University",
      "Chandrima Uddan",
      "khamar bari",
      "Farmgate",
      "Khamar Bari Mor",
      "Manik Mia Avenue",
      "mirpur 13",
      "মিরপুর ১৩",
      "সেনপাড়া",
      "senpara",
    ],
    routeCoordinatesInOrder: [
      LatLng(23.83944781693273, 90.35820879403578), // BUP In Gate
      LatLng(23.834961899131887, 90.35881453781377), // DSCSC
      LatLng(23.831960189009205, 90.36158785487743), // DSCSC Mosque
      LatLng(23.83202282231956, 90.36375703347682), // NDC
      LatLng(23.82936317999573, 90.3639233166183),
      LatLng(23.82833028743252, 90.36419160562757), // Mirpur 12
      LatLng(23.82450543703228, 90.36437900329229), // Mirpur 11.5
      LatLng(23.82036352400906, 90.36507633985794), // Kalshi
      LatLng(23.815769995859302, 90.36622426033027), // Mirpur 11
      LatLng(23.809380114118245, 90.3680910751687), // Mirpur 6
      LatLng(23.807245477575457, 90.36862448284556), // Mirpur 10
      LatLng(23.80716133960446, 90.36879237539863),
      LatLng(23.806945339889573, 90.36870120265397), // Mirpur 10
      LatLng(23.80001142428453, 90.37176789534682), // Kazipara
      LatLng(23.791012472863233, 90.37567151068914), // Shewrapara
      LatLng(23.78527635521034, 90.37809342927011), // Taltola
      LatLng(23.777636891888797, 90.3804319552363), // Agargaon
      LatLng(23.7656149661502, 90.38331629747529), // Chandrima Uddan
      LatLng(23.758971060492197, 90.38385359162103), // Farmgate
    ],
    end: "Khamar Bari Mor",
    endLat: 23.758971060492197,
    endLong: 90.38385359162103,
  ),
  route6(
    title: "BUP-Asad Gate",
    busId: ["busID11", "busID13"],
    image: "BUS_ROUTE_STD-5.png",
    start: "BUP",
    startLat: 23.83944781693273,
    startLong: 90.35820879403578,
    stopsInOrder: [
      "Mirpur 12",
      "Mirpur 11.5",
      "Mirpur 11",
      "মিরপুর ১২",
      "মিরপুর ১১.৫",
      "মিরপুর ১১",
      "মিরপুর ৬",
      "Proshika",
      "প্রশিকা",
      "Commerce College",
      "কমার্স কলেজ",
      "Sony Hall",
      "সনি",
      "Mirpur 01",
      "মিরপুর ১",
      "মিরপুর-১",
      "Mirpur 6",
      "Ansar Camp",
      "আনসার ক্যাম্প",
      "Bangla College",
      "বাংলা কলেজ",
      "Technical",
      "টেকনিক্যাল",
      "Kallyanpur",
      "কল্যাণপুর",
      "Shamoli",
      "শামলী",
      "Samoili",
      "Shyamoli",
      "শ্যামলি",
      "শ্যামলী",
      "DRMC",
      "Residential Model College",
      "রেসিডেনশিয়াল মডেল কলেজ",
      "College Gate",
      "কলেজ গেট",
      "Asad Gate",
      "আসাদ গেট",
      "Shia Moshjid",
      "শিয়া মসজিদ",
      "sia masjid",
      "Shia Mosque",
      "শিয়া মসজিদ",
      "Shuchona Center",
      "shuchona center",
      "সুচনা সেন্টার",
      "japan garden city",
      "জাপান গার্ডেন সিটি",
      "Adabor Thana",
      "আদাবর থানা",
      "মোহাম্মদপুর",
      "mohammadpur",
      "মোহাম্মদপুর",
      "মুহাম্মদপুর",
      "Mommodpur",
    ],
    routeCoordinatesInOrder: [
      LatLng(23.83944781693273, 90.35820879403578), // BUP In Gate
      LatLng(23.834961899131887, 90.35881453781377), // DSCSC
      LatLng(23.831960189009205, 90.36158785487743), // DSCSC Mosque
      LatLng(23.831993428090584, 90.3636712000425), // NDC
      LatLng(23.82450543703228, 90.36437900329229), // Mirpur 11.5
      LatLng(23.81575733203357, 90.36609331950163), // Mirpur 11/Milk-vita Road
      LatLng(23.81497659913363, 90.36272507856626), // Spartan Fitness
      LatLng(23.811432855624155, 90.36078667427861), // Nishat Bike Zone
      LatLng(23.809448679628332, 90.36116408985072), // Proshika
      LatLng(23.806011086470996, 90.35154979834113), // Commerce College
      LatLng(23.805125077616925, 90.35166838227215), // Commerce College mor
      LatLng(23.79997655599662, 90.3552123423596), // Sony Hall
      LatLng(23.798556103428073, 90.35323394679146), // Mirpur 01
      LatLng(23.785152440899125, 90.35384335041337), // Bangla College
      LatLng(23.781608038156982, 90.35178387650694), // Technical
      LatLng(23.7791332296404, 90.35649725740001), // Khalek Pump
      LatLng(23.778578290239505, 90.35995456599186), // Kallyanpur
      LatLng(23.773371725590795, 90.36720947907511), // Shishu Mela
      LatLng(23.76805928059568, 90.36928405313525), // College Gate
      LatLng(23.766592534981903, 90.36471550634664), // Camp
      LatLng(23.764297102547562, 90.36547849220003), // Tajmohol Road
      LatLng(23.762417539817875, 90.3588409967391), // Shia Moshjid
      LatLng(23.767450168551715, 90.35840866000913), // Shuchona Center
      LatLng(23.76931748386433, 90.3585873725444), // Shahabuddin Plaza
      LatLng(23.770513773002293, 90.35908612170924), // Adabor Thana
      LatLng(23.773386289116733, 90.36109877221789), // Shompa Market
      LatLng(23.774885890029985, 90.3655158643938), // Shamoli
    ],
    end: "Shia Moshjid",
    endLat: 23.762417539817875,
    endLong: 90.3588409967391,
  ),
  route7(
    title: "BUP-City College",
    busId: ["busID12", "busID14"],
    image: "BUS_ROUTE_STD-6.png",
    start: "BUP",
    startLat: 23.83944781693273,
    startLong: 90.35820879403578,
    stopsInOrder: [
      "Mirpur 12",
      "Mirpur 11.5",
      "Mirpur 11",
      "মিরপুর ১২",
      "মিরপুর ১১.৫",
      "মিরপুর ১১",
      "মিরপুর ৬",
      "Proshika",
      "প্রশিকা",
      "Commerce College",
      "কমার্স কলেজ",
      "Sony Hall",
      "সনি",
      "Mirpur 01",
      "মিরপুর ১",
      "মিরপুর-১",
      "Mirpur 6",
      "Ansar Camp",
      "আনসার ক্যাম্প",
      "Bangla College",
      "বাংলা কলেজ",
      "Technical",
      "টেকনিক্যাল",
      "Kallyanpur",
      "কল্যাণপুর",
      "Shamoli",
      "শামলী",
      "Samoili",
      "Shyamoli",
      "শ্যামলি",
      "শ্যামলী",
      "DRMC",
      "Residential Model College",
      "রেসিডেনশিয়াল মডেল কলেজ",
      "College Gate",
      "কলেজ গেট",
      "Asad Gate",
      "আসাদ গেট",
      "Genetic Plaza",
      "জেনেটিক প্লাজা",
      "Dhanmondi 27",
      "ধানমন্ডি ২৭",
      "Dhanmondi",
      "ধানমন্ডি",
      "Agora Dhanmondi",
      "আগোরা ধানমন্ডি",
      "satmasjid road",
      "সাতমসজিদ রোড",
      "Sankar",
      "শংকর",
      "Rifles Square",
      "Dhanmondi 27 No Road",
      "Dhanmondi 7 No Road",
      "Rapa plaza",
      "Dhanmondi 15",
      "ধানমন্ডি ১৫",
      "Shimanto Sqaure",
      "Simanto Square",
      "সীমান্ত স্কয়ার",
      "সিমান্ত স্কয়ার",
      "City College",
      "সিটি কলেজ",
      "BGB 4 No Gate",
      "বিজিবি ৪ নং গেট",
    ],
    routeCoordinatesInOrder: [
      LatLng(23.83944781693273, 90.35820879403578), // BUP In Gate
      LatLng(23.834961899131887, 90.35881453781377), // DSCSC
      LatLng(23.831960189009205, 90.36158785487743), // DSCSC Mosque
      LatLng(23.831993428090584, 90.3636712000425), // NDC
      LatLng(23.82450543703228, 90.36437900329229), // Mirpur 11.5
      LatLng(23.81575733203357, 90.36609331950163), // Mirpur 11/Milk-vita Road
      LatLng(23.81497659913363, 90.36272507856626), // Spartan Fitness
      LatLng(23.811432855624155, 90.36078667427861), // Nishat Bike Zone
      LatLng(23.809448679628332, 90.36116408985072), // Proshika
      LatLng(23.806011086470996, 90.35154979834113), // Commerce College
      LatLng(23.805125077616925, 90.35166838227215), // Commerce College mor
      LatLng(23.79997655599662, 90.3552123423596), // Sony Hall
      LatLng(23.798556103428073, 90.35323394679146), // Mirpur 01
      LatLng(23.785152440899125, 90.35384335041337), // Bangla College
      LatLng(23.781608038156982, 90.35178387650694), // Technical
      LatLng(23.7791332296404, 90.35649725740001), // Khalek Pump
      LatLng(23.778578290239505, 90.35995456599186), // Kallyanpur
      LatLng(23.773371725590795, 90.36720947907511), // Shishu Mela
      LatLng(23.76805928059568, 90.36928405313525), // College Gate
      LatLng(23.76422310934237, 90.37073833361552), // Aurangajeb Road
      LatLng(23.756422136549237, 90.37528687446108), // Genetic Plaza
      LatLng(23.751743668846245, 90.36759269016606), // Ibn Sina
      LatLng(23.74164067368401, 90.3742900105101), // Ibn Sina
      LatLng(23.738358799060823, 90.37595889954443), // Shimanto Sqaure
      LatLng(23.739520720045885, 90.38321787625766), // City College
      LatLng(23.744720379331042, 90.38203916397235), // Dhanmondi 7 No Road
      LatLng(23.75644266256043, 90.37524425608902), // Genetic Plaza
    ],
    end: "City College",
    endLat: 23.739079042145477,
    endLong: 90.38338455092443,
  ),
  route8(
    title: "BUP-Jahangir Gate",
    busId: ["busID15", "busID16"],
    image: "BUS_ROUTE_STD-7.png",
    start: "BUP",
    startLat: 23.83944781693273,
    startLong: 90.35820879403578,
    stopsInOrder: [
      "DOHS",
      "ডিওএইচএস",
      "অবকাশ",
      "MCPSC",
      "সরবর",
      "পলাশ বিল্ডিং",
      "Polash Buildin",
      "DOHS Mall",
      "ECB Canteen",
      "ইসিবি ক্যান্টিন",
      "ECB Chattar",
      "Kalshi",
      "কালসি",
      "কালশি",
      "কালসী",
      "কালশী",
      "কালসি মোড়",
      "kalshi mor",
      "ECB",
      "ইসিবি",
      "ইসিবি চত্বর",
      "ইসিবি মোড়",
      "ইসিবি চত্বর",
      "ECB Chattar",
      "মানিকদি",
      "মানিকদী",
      "মানিকদি মোড়",
      "MES",
      "nirrjhor",
      "নির্ঝর",
      "nirjhar",
      "নির্ঝর",
      "nirjhor",
      "মেস",
      "এমইএস",
      "Matikata",
      "মাটিকাটা",
      "Zia Colony",
      "জিয়া কলোনি",
      "জিয়া কলোনী",
      "জিয়া কলনি",
      "CMH",
      "সিএমএইচ",
      "সিএমএইচ হাসপাতাল",
      "Army HQ",
      "আর্মি হেড কোয়ার্টার্স",
      "আর্মি হেড",
      "ঢাকা ক্যান্টনমেন্ট",
      "ঢাকা ক্যান্টনমেন্ট হেড কোয়ার্টার্স",
      "আদমজী কলেজ",
      "আদমজি",
      "পকেট গেট",
      "হাজী মহসিন",
      "BNS",
      "kafrul",
      "কাফরুল",
      "রজনীগন্ধা",
      "rajanigandha",
      "সি এস ডি",
      "গ্যারিসন",
      "ওয়ার্কশপ",
      "CSD",
      "Post Office",
      "পোস্ট অফিস",
      "Adamji",
      "Workshop",
      "Shahid Jahangir Gate",
      "জাহাঙ্গীর গেট",
      "Jahangir Gate",
      "জাহাঙ্গীরগেট",
      "শাহীন কলেজ",
      "শাহিন কলেজ",
      "BAF Shaeen College",
    ],
    routeCoordinatesInOrder: [
      LatLng(23.83944781693273, 90.35820879403578), // BUP In Gate
      LatLng(23.834961899131887, 90.35881453781377), // DSCSC
      LatLng(23.831960189009205, 90.36158785487743), // DSCSC Mosque
      LatLng(23.831993428090584, 90.3636712000425), // NDC
      LatLng(23.833415394533798, 90.3636705510294), //OBOKASH
      LatLng(23.837073469037144, 90.36348384906073), //Polash Building
      LatLng(23.837253820339757, 90.36363221509522), // Carwash
      LatLng(23.837347046427823, 90.36630742234367), // DOHS AV2
      LatLng(23.837745136964287, 90.37424961459355), // DOHS AV8
      LatLng(23.83739951887143, 90.37584436492884), // DOHS Mall
      LatLng(23.83676251822987, 90.37646765936063), //Shagufta
      LatLng(23.83215846603242, 90.37673091487551), //Shopnonagar
      LatLng(23.823186151034655, 90.377942996345), // Kalshi Mor
      LatLng(23.82311043108477, 90.37807116664166),
      LatLng(23.823203651639872, 90.37871489905604), // Kalshi Mor2
      LatLng(23.823279734052914, 90.37901530420213),
      LatLng(23.82341714001223, 90.37944445768153),
      LatLng(23.823561904785667, 90.37984679034098), //mtd project
      LatLng(23.823564359783003, 90.380219616497885),
      LatLng(23.8234932022025, 90.380469061833),
      LatLng(23.82337542693857, 90.38075069370743),
      LatLng(23.822879784722247, 90.38156071988789),
      LatLng(23.822317890170762, 90.38236269865767),
      LatLng(23.82150326284769, 90.38344094575001), //safa automobil
      LatLng(23.820757323615396, 90.38459960402962),
      LatLng(23.820757318516836, 90.38485709635567),
      LatLng(23.820295950895957, 90.38674537202658), //volta
      LatLng(23.82005058162218, 90.38886970082721),
      LatLng(23.82030573710519, 90.39001768849784),
      LatLng(23.821414735192157, 90.39132663889457),
      LatLng(23.821640479173556, 90.39164849215575),
      LatLng(23.822327494921453, 90.39260336391328),
      LatLng(23.82262516657742, 90.3931673681746), //asw
      LatLng(23.822691396994813, 90.39346340743236),
      LatLng(23.82261213042945, 90.3936076607915),
      LatLng(23.82240205481611, 90.39365230428281), //ecb
      LatLng(23.821392435048026, 90.39465386440942),
      LatLng(23.819037996242226, 90.39677272653911), //mes flyover er niche
      LatLng(23.817916087030593, 90.39771163077164),
      LatLng(23.81749880563328, 90.39803219625557), //matikata mp checkpost
      LatLng(23.817136386955674, 90.39833622410896), //zia colony r signal head
      LatLng(23.816974410950166, 90.39864860526305),
      LatLng(23.8170160043422, 90.39855930479541),
      LatLng(23.816842495292146, 90.39890828026978),
      LatLng(23.816682863327852, 90.39957209239496),
      LatLng(23.816668982312855, 90.39960623124686),
      LatLng(23.81661692814612, 90.39976933919195),
      LatLng(23.816571813295983, 90.40001969128198), //AIr HQ Stop
      LatLng(23.816536232759834, 90.40088063558868),
      LatLng(23.81650340410433, 90.40119880832806),
      LatLng(23.81647477619833, 90.40204681334005),
      LatLng(23.816360241428942, 90.4020978484622), //U turn
      LatLng(23.816398950103476, 90.401243684606885),
      LatLng(23.816337570719906, 90.40071793497),
      LatLng(23.816331436130604, 90.40037193007704),
      LatLng(23.816320394008184, 90.40025659512408),
      LatLng(23.81555559124947, 90.40025512816125), //CMH gate
      LatLng(23.81461467462672, 90.40027768235286), //AFP
      LatLng(23.81381818835985, 90.40027768540892),
      LatLng(23.8131455111835, 90.4001558886942), //AFIP BUS STOP
      LatLng(23.81158140560969, 90.39961909114199), //VSOQ MESS
      LatLng(23.810351572072737, 90.3992717475962),
      LatLng(23.809670615967857, 90.39921310707891),
      LatLng(23.806714812211403, 90.39889221814245),
      LatLng(23.805732564348258, 90.39852682983236), //DC BUS STOP
      LatLng(23.80439536850653, 90.39773290916798),
      LatLng(23.80368549313562, 90.39702920523685),
      LatLng(23.8024741722743, 90.39581655215709), //CSD CInderella
      LatLng(23.80158570152203, 90.39490618488685),
      LatLng(23.800509816897165, 90.39438272340325),
      LatLng(23.79997534531362, 90.39415513191791),
      LatLng(23.799454740139716, 90.3940185760419),
      LatLng(23.797872105473374, 90.39357855746375), //Shikha anirban
      LatLng(23.79541483380337, 90.39292612098482), //mynul road
      LatLng(23.79252712612295, 90.39230403490515),
      LatLng(23.7905279128453, 90.39187160827302), //4 rasta
      LatLng(23.788632793092475, 90.39118882817917),
      LatLng(23.787168049614365, 90.39089295773681),
      LatLng(23.786480785589244, 90.3906274374047),
      LatLng(23.785085434244245, 90.39015707311444), //ISPRD
      LatLng(23.78308610812019, 90.38956533179567),
      LatLng(23.781794852076256, 90.38943636122195),
      LatLng(23.779274785290017, 90.38939843402872), //Basar base
      LatLng(23.77576484099117, 90.38987603610781), // Jahangir Gate
      LatLng(23.775757779527297, 90.38994748427129), // Jahangir Gate Final
    ],
    end: "Jahangir Gate",
    endLat: 23.775757779527297,
    endLong: 90.38994748427129,
  );

  const RouteModel({
    required this.title,
    required this.busId,
    required this.image,
    required this.start,
    required this.startLat,
    required this.startLong,
    required this.stopsInOrder,
    required this.routeCoordinatesInOrder,
    required this.end,
    required this.endLat,
    required this.endLong,
  });

  final String title;
  final List<String> busId;
  final String image;
  final String start;
  final double startLat;
  final double startLong;
  final List<String> stopsInOrder;
  final List<LatLng> routeCoordinatesInOrder;
  final String end;
  final double endLat;
  final double endLong;
}
